src/cf/src/DataProcessors/СмокТест/СмокТест.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>СмокТест</name>
  <comment>Технологическая обработка подсистемы «Автотесты»: открытие всех форм конфигурации и формирование всех печатных форм. Запускается параметром /C "СмокТест;путь-к-отчёту", см. docs/TESTING.md.</comment>
</mdclass:DataProcessor>

src/cf/src/InformationRegisters/Лиды/Лиды.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Лиды</name>
  <dimensions>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Канал</name>
    <type>
      <types>CatalogRef.Каналы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПолноеИмя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерТелефона</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>EMail</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЗаказПокупателя</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Комментарий</name>
    <type>
      <types>DefinedType.Комментарий</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыЛидов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сумма</name>
    <type>
      <types>DefinedType.СуммаНеотрицательная</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Закрыт</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/cf/src/AccumulationRegisters/ТоварыВНаличии/ТоварыВНаличии.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ТоварыВНаличии</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>DefinedType.Количество</types>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </resources>
  <resources>
    <name>СуммаНДС</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </resources>
  <attributes>
    <name>Комплект</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <dimensions>
    <name>МестоХранения</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Серия</name>
    <type>
      <types>CatalogRef.СерииНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Партия</name>
    <type>
      <types>DefinedType.ПриходныйДокументПартии</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаПартии</name>
    <comment>Реквизит для ускорения выборки по FIFO</comment>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/cf/src/Documents/ЗаказПоставщику/ЗаказПоставщику.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаказПоставщику</name>
  <basedOn>Document.ЗаказПокупателя</basedOn>
  <basedOn>Document.ПредложениеПоставщика</basedOn>
  <registerRecords>AccumulationRegister.ЗаказыПоставщикам</registerRecords>
  <registerRecords>AccumulationRegister.ПотребностиПроизводства</registerRecords>
  <attributes>
    <name>ВидЗаказа</name>
    <type>
      <types>EnumRef.ВидыЗаказовПоставщику</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПоставки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыСКонтрагентами</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>DefinedType.Комментарий</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>DefinedType.СуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаНДС</name>
    <type>
      <types>DefinedType.СуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаБезНДС</name>
    <type>
      <types>DefinedType.СуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦенаВключаетНДС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВВалюте</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>КурсВалюты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаРегл</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТЧТовары</name>
    <attributes>
      <name>ЗаказПоставщику</name>
      <type>
        <types>DocumentRef.ЗаказПоставщику</types>
      </type>
    </attributes>
    <attributes>
      <name>КодСтроки</name>
      <type>
        <types>DefinedType.КодСтроки</types>
      </type>
    </attributes>
    <attributes>
      <name>НоменклатураКонтрагента</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <type>
        <types>DefinedType.КоличествоНеотрицательное</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.КоличествоНеотрицательное</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаСНДС</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>CatalogRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>DefinedType.Комментарий</types>
      </type>
    </attributes>
    <attributes>
      <name>Продукция</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаРегл</name>
      <type>
        <types>DefinedType.Сумма</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/cf/src/Documents/ОперацияБух/ОперацияБух.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ОперацияБух</name>
  <registerRecords>AccountingRegister.Хозрасчетный</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаОперации</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </attributes>
  <attributes>
    <name>Содержание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТиповаяОперация</name>
    <type>
      <types>String</types>
      <types>DocumentRef</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ЗапрашиваемыеПараметры</name>
    <attributes>
      <name>Имя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Boolean</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <types>AnyRef</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТаблицаРегистровСведений</name>
    <attributes>
      <name>Имя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТаблицаРегистровНакопления</name>
    <attributes>
      <name>Имя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЗаполнениеДвижений</name>
    <attributes>
      <name>Документ</name>
      <type>
        <types>DocumentRef</types>
      </type>
    </attributes>
    <attributes>
      <name>Примечание</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/cf/src/DataProcessors/СмокТест/ManagerModule.bsl
////////////////////////////////////////////////////////////////////////////////
// Серверная часть автотестов: состав проверяемых форм и прогон печатных форм.
// Модуль формы обработки - только запуск и отчёт, вся логика проверок здесь.
// Регламент и разбор ошибок - docs/TESTING.md.
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Полные имена форм конфигурации, которые проверяет первый проход смок-теста.
// Формы из списка пропусков и формы только для мобильного устройства не попадают.
//
// Возвращаемое значение:
//  Массив из Строка - полные имена форм, например "Документ.РеализацияТоваровУслуг.Форма.ФормаДокумента"
//
Функция ПроверяемыеФормы() Экспорт

	Формы = Новый Массив;
	Пропуски = ПропускаемыеФормы();

	Для Каждого Коллекция Из КоллекцииМетаданныхСФормами() Цикл
		Для Каждого ОбъектМетаданных Из Коллекция Цикл
			Для Каждого МетаданныеФормы Из ОбъектМетаданных.Формы Цикл
				ДобавитьФорму(Формы, МетаданныеФормы, Пропуски);
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;

	Для Каждого МетаданныеФормы Из Метаданные.ОбщиеФормы Цикл
		ДобавитьФорму(Формы, МетаданныеФормы, Пропуски);
	КонецЦикла;

	Возврат Формы;

КонецФункции

// Второй проход смока: формирует все печатные формы объектов, переведённых на подсистему печати.
// Для каждого объекта берётся один образец из базы, по нему формируется каждая его печатная форма.
//
// Возвращаемое значение:
//  Структура - итог прогона печати:
//   * Строки - Массив из Строка - строки отчёта видов ОШИБКА, ПУСТО, ПРОПУСК и ПОДОЗРЕНИЕ
//   * Всего  - Число           - сколько печатных форм формировалось
//   * Ошибок - Число           - сколько из них не сформировалось
//
Функция ПрогнатьПечатныеФормы() Экспорт

	Итог = Новый Структура("Строки, Всего, Ошибок", Новый Массив, 0, 0);
	Строки = Итог.Строки;
	Пропуски = ПропускаемыеПечатныеФормы();

	Для Каждого ПолноеИмяОбъекта Из ПечатныеФормы.ОбъектыСКомандамиПечати() Цикл

		Команды = ПечатныеФормы.КомандыПечатиОбъекта(ПолноеИмяОбъекта);
		Если Команды.Количество() = 0 Тогда
			Строки.Добавить("ОШИБКА;Печать." + ПолноеИмяОбъекта
				+ ";объект заявлен в ОбъектыСКомандамиПечати, но команд печати не вернул");
			Итог.Ошибок = Итог.Ошибок + 1;
			Продолжить;
		КонецЕсли;

		Образец = ОбразецДляПечати(ПолноеИмяОбъекта);
		Если Образец = Неопределено Тогда
			Строки.Добавить("ПРОПУСК;Печать." + ПолноеИмяОбъекта + ";в базе нет ни одного объекта");
			Продолжить;
		КонецЕсли;

		МассивОбъектов = Новый Массив;
		МассивОбъектов.Добавить(Образец);

		Для Каждого Команда Из Команды Цикл
			ПроверитьПечатнуюФорму(ПолноеИмяОбъекта, Команда.ИмяМакета, МассивОбъектов, Пропуски, Строки, Итог);
		КонецЦикла;

	КонецЦикла;

	Возврат Итог;

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Формирует одну печатную форму и складывает результат проверки в отчёт.
//
// Параметры:
//  ПолноеИмяОбъекта - Строка          - объект, чей модуль менеджера печатает
//  ИмяМакета        - Строка          - печатная форма из команд печати объекта
//  МассивОбъектов   - Массив          - образец объекта для печати
//  Пропуски         - Массив из Строка - исключённые печатные формы
//  Строки           - Массив из Строка - пополняемые строки отчёта
//  Итог             - Структура       - см. ПрогнатьПечатныеФормы
//
Процедура ПроверитьПечатнуюФорму(ПолноеИмяОбъекта, ИмяМакета, МассивОбъектов, Пропуски, Строки, Итог)

	Путь = "Печать." + ПолноеИмяОбъекта + "." + ИмяМакета;
	Если Пропуски.Найти(Путь) <> Неопределено Тогда
		Строки.Добавить("ПРОПУСК;" + Путь + ";исключена в ПропускаемыеПечатныеФормы");
		Возврат;
	КонецЕсли;

	Итог.Всего = Итог.Всего + 1;

	Попытка
		Результат = ПечатныеФормы.СформироватьПечатныеФормы(ПолноеИмяОбъекта, ИмяМакета, МассивОбъектов);
		ПечатнаяФорма = Результат.КоллекцияПечатныхФорм.Найти(ИмяМакета, "ИмяМакета");
		Если ПечатнаяФорма = Неопределено
			Или ТипЗнч(ПечатнаяФорма.ТабличныйДокумент) <> Тип("ТабличныйДокумент") Тогда
			Строки.Добавить("ОШИБКА;" + Путь + ";модуль менеджера не вернул табличный документ");
			Итог.Ошибок = Итог.Ошибок + 1;
			Возврат;
		КонецЕсли;
		Если ПечатнаяФорма.ТабличныйДокумент.ВысотаТаблицы = 0 Тогда
			// Не ошибка: у образца может не быть строк. Но пустых форм быть не должно много.
			Строки.Добавить("ПУСТО;" + Путь);
		Иначе
			ПроверитьНомерВПечатнойФорме(Путь, ПечатнаяФорма.ТабличныйДокумент, МассивОбъектов[0], Строки);
		КонецЕсли;
	Исключение
		// BSLLS:DeprecatedMethodCall-off
		Представление = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		// BSLLS:DeprecatedMethodCall-on
		Строки.Добавить("ОШИБКА;" + Путь + ";" + СтрЗаменить(Представление, Символы.ПС, " | "));
		Итог.Ошибок = Итог.Ошибок + 1;
	КонецПопытки;

КонецПроцедуры

// Ищет номер документа-образца в тексте сформированной печатной формы. Заполненная шапка
// его содержит, пустая - нет: прогон видит только исключения, а пустое поле от заполненного
// не отличает. Строка ПОДОЗРЕНИЕ - не ошибка прогона, а повод посмотреть форму глазами.
//
// Параметры:
//  Путь    - Строка            - путь печатной формы в отчёте
//  ТабДок  - ТабличныйДокумент - сформированная печатная форма
//  Образец - ЛюбаяСсылка       - объект, по которому печатали
//  Строки  - Массив из Строка  - пополняемые строки отчёта
//
Процедура ПроверитьНомерВПечатнойФорме(Путь, ТабДок, Образец, Строки)

	Если ПечатныеФормыБезНомера().Найти(Путь) <> Неопределено Тогда
		Возврат;
	КонецЕсли;

	ОбъектМетаданных = Метаданные.НайтиПоТипу(ТипЗнч(Образец));
	Если ОбъектМетаданных = Неопределено Или Не Метаданные.Документы.Содержит(ОбъектМетаданных) Тогда
		Возврат;
	КонецЕсли;

	Номер = СокрЛП(Образец.Номер);
	Если ПустаяСтрока(Номер) Тогда
		Возврат;
	КонецЕсли;

	Текст = ТекстПечатнойФормы(ТабДок);
	Для Каждого Вариант Из ВариантыНомера(Номер) Цикл
		Если СтрНайти(Текст, Вариант) > 0 Тогда
			Возврат;
		КонецЕсли;
	КонецЦикла;

	Строки.Добавить("ПОДОЗРЕНИЕ;" + Путь + ";номера документа " + Номер
		+ " в печатной форме нет - шапка может быть пустой");

КонецПроцедуры

// Весь текст сформированной печатной формы одной строкой - по нему ищутся реквизиты шапки.
//
// Параметры:
//  ТабДок - ТабличныйДокумент - сформированная печатная форма
//
// Возвращаемое значение:
//  Строка - тексты заполненных ячеек через перевод строки
//
Функция ТекстПечатнойФормы(ТабДок)

	Части = Новый Массив;
	Для НомерСтроки = 1 По ТабДок.ВысотаТаблицы Цикл
		Для НомерКолонки = 1 По ТабДок.ШиринаТаблицы Цикл
			Ячейка = ТабДок.Область(НомерСтроки, НомерКолонки, НомерСтроки, НомерКолонки);
			Если Не ПустаяСтрока(Ячейка.Текст) Тогда
				Части.Добавить(Ячейка.Текст);
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;

	Возврат СтрСоединить(Части, Символы.ПС);

КонецФункции

// Как номер документа может выглядеть в печатной форме: полностью и без префикса с ведущими
// нулями - печатные формы выводят его и так, и так.
//
// Параметры:
//  Номер - Строка - номер документа
//
// Возвращаемое значение:
//  Массив из Строка - варианты для поиска
//
Функция ВариантыНомера(Номер)

	Варианты = Новый Массив;
	Варианты.Добавить(Номер);

	Цифры = "";
	Для Позиция = 1 По СтрДлина(Номер) Цикл
		Символ = Сред(Номер, Позиция, 1);
		Если СтрНайти("0123456789", Символ) > 0 Тогда
			Цифры = Цифры + Символ;
		Иначе
			Цифры = "";
		КонецЕсли;
	КонецЦикла;

	ПерваяЗначащая = 1;
	Пока ПерваяЗначащая < СтрДлина(Цифры) И Сред(Цифры, ПерваяЗначащая, 1) = "0" Цикл
		ПерваяЗначащая = ПерваяЗначащая + 1;
	КонецЦикла;
	Цифры = Сред(Цифры, ПерваяЗначащая);

	Если Не ПустаяСтрока(Цифры) И Цифры <> Номер Тогда
		Варианты.Добавить(Цифры);
	КонецЕсли;

	Возврат Варианты;

КонецФункции

// Печатные формы, в которых номера документа-образца заведомо нет: проверка шапки их не касается.
//
// Возвращаемое значение:
//  Массив из Строка - пути печатных форм вида "Печать.<объект>.<макет>"
//
Функция ПечатныеФормыБезНомера()

	Формы = Новый Массив;
	// Пополняется по строкам ПОДОЗРЕНИЕ прогона - вместе с причиной в docs/TESTING.md.
	Возврат Формы;

КонецФункции

// Один объект из базы, на котором проверяются печатные формы: последний проведённый документ
// либо любой элемент справочника.
//
// Параметры:
//  ПолноеИмяОбъекта - Строка - полное имя объекта метаданных
//
// Возвращаемое значение:
//  ЛюбаяСсылка, Неопределено - образец или Неопределено, если объектов в базе нет
//
Функция ОбразецДляПечати(ПолноеИмяОбъекта)

	Если ПолноеИмяОбъекта = "РегистрСведений.Лиды" Тогда
		// Лиды печатают заказ покупателя, оформленный по лиду, а не саму запись регистра.
		ТекстЗапроса =
			"ВЫБРАТЬ ПЕРВЫЕ 1
			|	Лиды.ЗаказПокупателя КАК Ссылка
			|ИЗ
			|	РегистрСведений.Лиды КАК Лиды
			|ГДЕ
			|	Лиды.ЗаказПокупателя <> ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)";
	ИначеЕсли СтрНачинаетсяС(ПолноеИмяОбъекта, "Документ.") Тогда
		ТекстЗапроса =
			"ВЫБРАТЬ ПЕРВЫЕ 1
			|	Таблица.Ссылка КАК Ссылка
			|ИЗ
			|	&ИмяТаблицы КАК Таблица
			|УПОРЯДОЧИТЬ ПО
			|	Таблица.Проведен УБЫВ,
			|	Таблица.Дата УБЫВ";
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ИмяТаблицы", ПолноеИмяОбъекта);
	Иначе
		ТекстЗапроса =
			"ВЫБРАТЬ ПЕРВЫЕ 1
			|	Таблица.Ссылка КАК Ссылка
			|ИЗ
			|	&ИмяТаблицы КАК Таблица";
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ИмяТаблицы", ПолноеИмяОбъекта);
	КонецЕсли;

	Запрос = Новый Запрос(ТекстЗапроса);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;
	Возврат Неопределено;

КонецФункции

// Печатные формы, которые прогон не проверяет. Каждый пропуск - с причиной.
// Пополняя список, фиксируй причину и здесь, и в docs/TESTS.xlsx (лист «Пропуски смока»).
//
// Возвращаемое значение:
//  Массив из Строка - пути вида "Печать.Документ.Имя.ИмяМакета"
//
Функция ПропускаемыеПечатныеФормы()

	Пропуски = Новый Массив;
	Возврат Пропуски;

КонецФункции

Функция КоллекцииМетаданныхСФормами()

	Коллекции = Новый Массив;
	Коллекции.Добавить(Метаданные.Справочники);
	Коллекции.Добавить(Метаданные.Документы);
	Коллекции.Добавить(Метаданные.ЖурналыДокументов);
	Коллекции.Добавить(Метаданные.Перечисления);
	Коллекции.Добавить(Метаданные.Отчеты);
	Коллекции.Добавить(Метаданные.Обработки);
	Коллекции.Добавить(Метаданные.ПланыВидовХарактеристик);
	Коллекции.Добавить(Метаданные.ПланыСчетов);
	Коллекции.Добавить(Метаданные.ПланыОбмена);
	Коллекции.Добавить(Метаданные.РегистрыСведений);
	Коллекции.Добавить(Метаданные.РегистрыНакопления);
	Коллекции.Добавить(Метаданные.РегистрыБухгалтерии);
	Коллекции.Добавить(Метаданные.КритерииОтбора);
	Возврат Коллекции;

КонецФункции

Процедура ДобавитьФорму(Формы, МетаданныеФормы, Пропуски)

	ПолноеИмя = МетаданныеФормы.ПолноеИмя();
	Если Пропуски.Найти(ПолноеИмя) <> Неопределено Тогда
		Возврат;
	КонецЕсли;
	Если Не ФормаДоступнаНаКомпьютере(МетаданныеФормы) Тогда
		Возврат;
	КонецЕсли;
	Формы.Добавить(ПолноеИмя);

КонецПроцедуры

Функция ФормаДоступнаНаКомпьютере(МетаданныеФормы)

	Назначения = Неопределено;
	Попытка
		Назначения = МетаданныеФормы.НазначенияИспользования;
	Исключение
		// Свойство недоступно на текущей платформе - считаем форму настольной.
		Возврат Истина;
	КонецПопытки;
	Если Назначения = Неопределено Тогда
		// Назначения не заданы - форма доступна везде, в том числе на компьютере.
		Возврат Истина;
	КонецЕсли;

	// Сравнение по XML-имени: системного перечисления «ИспользованиеНазначения» в глобальном
	// контексте сервера нет (проверено CheckConfig), а XML-имена стабильны и не зависят от локали.
	Для Каждого Назначение Из Назначения Цикл
		Попытка
			ИмяНазначения = XMLСтрока(Назначение);
		Исключение
			// Значение не сериализуется - не рискуем, считаем форму настольной.
			Возврат Истина;
		КонецПопытки;
		Если ИмяНазначения = "PersonalComputer" Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;
	Возврат Ложь;

КонецФункции

Функция ПропускаемыеФормы()

	// Формы, которые нельзя получить без параметров или контекста. Каждый пропуск - с причиной.
	// Пополняя список, фиксируй причину и здесь, и в docs/TESTS.xlsx (лист «Пропуски смока»).
	Пропуски = Новый Массив;

	// Обязательные параметры формы (без них ПриСозданииНаСервере падает по построению).
	Пропуски.Добавить("Справочник.СерииНоменклатуры.Форма.УстановкаСерий");
	Пропуски.Добавить("Справочник.СерииНоменклатуры.Форма.ВыборСерииПоОстаткам");
	Пропуски.Добавить("Справочник.УпаковкиЕдиницыИзмерения.Форма.ФормаВыбораИзДокументов");
	Пропуски.Добавить("Документ.ЗаказПоставщику.Форма.ПодборПредварительныхЗаказов");
	Пропуски.Добавить("Документ.ОперацияБух.Форма.ФормаНастройки");
	Пропуски.Добавить("Обработка.ГрупповоеИзменениеРеквизитов.Форма.ВыбранныеЭлементы");
	Пропуски.Добавить("Обработка.ГрупповоеИзменениеРеквизитов.Форма.РедактированиеФормулы");
	Пропуски.Добавить("Обработка.ЛичныйКабинетПартнера.Форма.ФормаЗаявкиНаПоискТовара");
	Пропуски.Добавить("Обработка.ПечатьЭтикеток.Форма.ВыборСерииПоОстаткам");
	Пропуски.Добавить("Обработка.РегистрацияИзмененийДляОбменаДанными.Форма.ВыборКонстанты");
	Пропуски.Добавить("Обработка.РегистрацияИзмененийДляОбменаДанными.Форма.ВыборОбъектовОтбором");
	Пропуски.Добавить("Обработка.РегламентныеИФоновыеЗадания.Форма.ДиалогРегламентногоЗадания");
	Пропуски.Добавить("Обработка.РегламентныеИФоновыеЗадания.Форма.ДиалогФоновогоЗадания");
	Пропуски.Добавить("Обработка.РегламентныеИФоновыеЗадания.Форма.ДиалогНастроекСписка");
	Пропуски.Добавить("Обработка.РегламентныеИФоновыеЗадания.Форма.ДиалогОтбораРегламентногоЗадания");
	Пропуски.Добавить("Обработка.РегламентныеИФоновыеЗадания.Форма.ДиалогОтбораФоновогоЗадания");
	Пропуски.Добавить("РегистрСведений.РеквизитыКонтрагентов.Форма.ИсторияИзменений");
	Пропуски.Добавить("РегистрСведений.РеквизитыКонтрагентов.Форма.ВводНомераТелефона");
	Пропуски.Добавить("РегистрСведений.РеквизитыКонтрагентов.Форма.ВводДополнительныхДанных");
	Пропуски.Добавить("РегистрНакопления.ТоварыВНаличии.Форма.ВыборПартииПоОстаткам");
	Пропуски.Добавить("ОбщаяФорма.ВыборЗначений");
	Пропуски.Добавить("ОбщаяФорма.ВыборСвязанныхДанных");
	Пропуски.Добавить("ОбщаяФорма.ПодборОбъектовРасчётовПоОстаткам");
	Пропуски.Добавить("ОбщаяФорма.РедактированиеНДСПлатёжногоДокумента");
	Пропуски.Добавить("ОбщаяФорма.ФормаНастройки1ССканерыШтрихкода");
	Пропуски.Добавить("ОбщаяФорма.ФормаНастройкиУниверсальныйДрайвер");

	// Платформа: форму отчёта можно получить только для конкретного отчёта.
	Пропуски.Добавить("ОбщаяФорма.ФормаОтчёта");

	// Окно печати открывается только с параметрами команды печати (ИмяМенеджераПечати,
	// ИменаМакетов, ОбъектыПечати); печатные формы проверяет второй проход прогона.
	Пропуски.Добавить("ОбщаяФорма.ПечатьДокументов");

	// Создание нового запрещено бизнес-логикой (ОбработкаЗаполнения: только вводом на основании).
	Пропуски.Добавить("Документ.ВозвратПоставщику.Форма.ФормаДокумента");
	Пропуски.Добавить("Документ.ВозвратПоставщикуНалоговый.Форма.ФормаДокумента");
	Пропуски.Добавить("Документ.ВыплатаЗарплаты.Форма.ФормаДокумента");

	// Интерактивное добавление не предусмотрено правами (объекты пополняются программно).
	Пропуски.Добавить("ПланВидовХарактеристик.ВидыНастроекПользователей.Форма.ФормаЭлемента");
	Пропуски.Добавить("ПланВидовХарактеристик.ВидыНастроекПользователей.Форма.ФормаГруппы");
	Пропуски.Добавить("ПланВидовХарактеристик.ВидыРеквизитовКонтрагентов.Форма.ФормаЭлемента");
	Пропуски.Добавить("ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.Форма.ФормаЭлемента");
	Пропуски.Добавить("ПланСчетов.Хозрасчетный.Форма.ФормаСчета");
	Пропуски.Добавить("Справочник.ВариантыВыходаНаРаботу.Форма.ФормаЭлемента");

	// Обработка сама запрещает запуск при включённом режиме совместимости - до поднятия
	// compatibilityMode (docs/TECHDEBT.md).
	Пропуски.Добавить("Обработка.ГрупповоеИзменениеРеквизитов.Форма.Форма");

	Возврат Пропуски;

КонецФункции

#КонецОбласти
